#+BEGIN_COMMENT
.. title: The Pox Probabilities
.. slug: the-pox-probabilities
.. date: 2019-06-05 17:17:38 UTC-07:00
.. tags: bayes,notes
.. category: Bayes Theorem
.. link: 
.. description: An example of Bayes' Theorem using pox.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+OPTIONS: H:5
#+TOC: headlines 2
#+BEGIN_SRC ipython :session pox :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** Inspecting
   While the tests sort of give us a decent sense that things are working, let's take a look at the actual numbers.

#+begin_src python :session pox :results output :exports both
print(str(Poxes().diagnosis))
#+end_src

#+RESULTS:
: Disease 1: Small Pox, Posterior Probability: 0.011
: Disease 2: Chicken Pox, Posterior Probability: 0.988
: Most Likely: Chicken Pox, Posterior Ratio: 88.889

So Chicken Pox is about 89 times more likely to be the reason for the spots than small pox.

